MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX130F128H.atdf
      <value-group caption="Reference Clock Request Status bit" name="REFOCON__ACTIVE">
         <value caption="Reference clock request is active" name="ACTIVE" value="0x1" />
         <value caption="Reference clock request is not active" name="INACTIVE" value="0x0" />
      </value-group>
      <value-group caption="Divider Switch Enable bit" name="REFOCON__DIVSWEN">
         <value caption="Divider switch is in progress" name="IN_PROGRESS" value="0x1" />
         <value caption="Divider switch is complete" name="DONE" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Module Run in Sleep bit" name="REFOCON__RSLP">
         <value caption="Reference Oscillator Module output continues to run in Sleep" name="ENABLE" value="0x1" />
         <value caption="Reference Oscillator Module output is disabled in Sleep" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Output Enable bit" name="REFOCON__OE">
         <value caption="Reference clock is driven out on REFCLKO pin" name="ENABLE" value="0x1" />
         <value caption="Reference clock is not driven out on REFCLKO pin" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFOCON__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="ENABLE" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="Output Enable bit" name="REFOCON__ON">
         <value caption="Reference Oscillator Module is enabled" name="ENABLE" value="0x1" />
         <value caption="Reference Oscillator Module is disabled" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Divider bits" name="REFOCON__RODIV">
         <value caption="Reference Clock output is same as source clock" name="NO_DIV" value="0x0" />
         <value caption="Reference Clock output is source clock divided by 2" name="DIV_2" value="0x1" />
         <value caption="Reference Clock output is source clock divided by 4" name="DIV_4" value="0x2" />
         <value caption="Reference Clock output is source clock divided by 65534" name="DIV_65534" value="0x7FFF" />
      </value-group>
      <value-group caption="Reference Oscillator Trim bits" name="REFOTRIM__ROTRIM">
         <value caption="511/512 divisor added to RODIV value" name="DIV_511" value="0x1ff" />
         <value caption="510/512 divisor added to RODIV value" name="DIV_510" value="0x1fe" />
         <value caption="256/512 divisor added to RODIV value" name="DIV_256" value="0x100" />
         <value caption="2/512 divisor added to RODIV value" name="DIV_2" value="0x2" />
         <value caption="1/512 divisor added to RODIV value" name="DIV_1" value="0x1" />
         <value caption="0/512 divisor added to RODIV value" name="DIV_0" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00751" name="PMP" version="1">
      <register-group name="PMP">
         <register caption="Parallel Port Control Register" name="PMCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Read Strobe Polarity bit" mask="0x00000001" name="RDSP" values="PMCON__RDSP" />
            <bitfield caption="Write Strobe Polarity bit" mask="0x00000002" name="WRSP" values="PMCON__WRSP" />
            <bitfield caption="Chip Select 1 Polarity bit" mask="0x00000008" name="CS1P" values="PMCON__CS1P" />
            <bitfield caption="Chip Select 2 Polarity bit" mask="0x00000010" name="CS2P" values="PMCON__CS2P" />
            <bitfield caption="Address Latch Polarity bit" mask="0x00000020" name="ALP" values="PMCON__ALP" />
            <bitfield caption="Chip Select Function bits" mask="0x000000C0" name="CSF" values="PMCON__CSF" />
            <bitfield caption="Read/Write Strobe Port Enable bit" mask="0x00000100" name="PTRDEN" values="PMCON__PTRDEN" />
            <bitfield caption="Write Enable Strobe Port Enable bit" mask="0x00000200" name="PTWREN" values="PMCON__PTWREN" />
            <bitfield caption="PMP Module TTL Input Buffer Select bit" mask="0x00000400" name="PMPTTL" values="PMCON__PMPTTL" />
            <bitfield caption="Address/Data Multiplexing Selection bits" mask="0x00001800" name="ADRMUX" values="PMCON__ADRMUX" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="PMCON__SIDL" />
            <bitfield caption="Parallel Master Port Enable bit" mask="0x00008000" name="ON" values="PMCON__ON" />
            <bitfield caption="Dual Read/Write Buffers enable bit" mask="0x00010000" name="DUALBUF" values="PMCON__DUALBUF" />
            <bitfield caption="Start Read on PMP Bus bit" mask="0x00800000" name="RDSTART" values="PMCON__RDSTART" />
         </register>
         <register caption="Parallel Port Mode Register" name="PMMODE" offset="0x10" rw="RW" size="4">
            <bitfield caption="Data Hold After Read/Write Strobe Wait States bits" mask="0x00000003" name="WAITE" values="PMMODE__WAITE" />
            <bitfield caption="Data Read/Write Strobe Wait States bits" mask="0x0000003C" name="WAITM" values="PMMODE__WAITM" />
            <bitfield caption="Data Setup to Read/Write Strobe Wait States bits" mask="0x000000C0" name="WAITB" values="PMMODE__WAITB" />
            <bitfield caption="" mask="0x00000300" name="MODE" values="PMMODE__MODE" />
            <bitfield caption="8/16-bit Mode bit" mask="0x00000400" name="MODE16" values="PMMODE__MODE16" />
            <bitfield caption="Increment Mode bits" mask="0x00001800" name="INCM" values="PMMODE__INCM" />
            <bitfield caption="Interrupt Request Mode bits" mask="0x00006000" name="IRQM" values="PMMODE__IRQM" />
            <bitfield caption="Busy bit" mask="0x00008000" name="BUSY" values="PMMODE__BUSY" />
         </register>
         <register caption="Parallel Port Address Register" name="PMADDR" offset="0x20" rw="RW" size="4">
            <bitfield caption="Address bits" mask="0x00003FFF" name="ADDR" values="PMADDR__ADDR" />
            <bitfield caption="Target Address bit 14" mask="0x00004000" name="ADDR14" values="PMADDR__ADDR14" />
            <bitfield caption="Target Address bit 15" mask="0x00008000" name="ADDR15" values="PMADDR__ADDR15" />
         </register>
         <register caption="Parallel Port Output Data Register" name="PMDOUT" offset="0x30" rw="RW" size="4">
            <bitfield caption="Port Data Output bits" mask="0xFFFFFFFF" name="DATAOUT" values="PMDOUT__DATAOUT" />
         </register>
         <register caption="Parallel Port Input Data Register" name="PMDIN" offset="0x40" rw="RW" size="4">
            <bitfield caption="Port Data Input bits" mask="0xFFFFFFFF" name="DATAIN" values="PMDIN__DATAIN" />
         </register>
         <register caption="Parallel Port Pin Enable Register" name="PMAEN" offset="0x50" rw="RW" size="4">
            <bitfield caption="PMALH/PMALL Strobe Enable bits" mask="0x00FFFFFF" name="PTEN" values="PMAEN__PTEN" />
         </register>
         <register caption="Parallel Port Status Register (Slave modes only)" name="PMSTAT" offset="0x60" rw="RW" size="4">
            <bitfield caption="Output Buffer 0 Status Empty bit" mask="0x00000001" name="OB0E" values="PMSTAT__OB0E" />
            <bitfield caption="Output Buffer 1 Status Empty bit" mask="0x00000002" name="OB1E" values="PMSTAT__OB1E" />
            <bitfield caption="Output Buffer 2 Status Empty bit" mask="0x00000004" name="OB2E" values="PMSTAT__OB2E" />
            <bitfield caption="Output Buffer 3 Status Empty bit" mask="0x00000008" name="OB3E" values="PMSTAT__OB3E" />
            <bitfield caption="Output Buffer Underflow Status bit" mask="0x00000040" name="OBUF" values="PMSTAT__OBUF" />
            <bitfield caption="Output Buffer Empty Status bit" mask="0x00000080" name="OBE" values="PMSTAT__OBE" />
            <bitfield caption="Input Buffer 0 Status Full bit" mask="0x00000100" name="IB0F" values="PMSTAT__IB0F" />
            <bitfield caption="Input Buffer 1 Status Full bit" mask="0x00000200" name="IB1F" values="PMSTAT__IB1F" />
            <bitfield caption="Input Buffer 2 Status Full bit" mask="0x00000400" name="IB2F" values="PMSTAT__IB2F" />
            <bitfield caption="Input Buffer 3 Status Full bit" mask="0x00000800" name="IB3F" values="PMSTAT__IB3F" />
            <bitfield caption="Input Buffer Overflow Status bit" mask="0x00004000" name="IBOV" values="PMSTAT__IBOV" />
            <bitfield caption="Input Buffer Full Status bit" mask="0x00008000" name="IBF" values="PMSTAT__IBF" />
         </register>
         <register caption="Parallel Port Write Address Register" name="PMWADDR" offset="0x70" rw="RW" size="4">
            <bitfield caption="Address bits" mask="0x00FFFFFF" name="WADDR" values="PMWADDR__WADDR" />
            <bitfield caption="Target Address bit 14" mask="0x01000000" name="WADDR14" values="PMWADDR__WADDR14" />
            <bitfield caption="Target Address bit 15" mask="0x02000000" name="WADDR15" values="PMWADDR__WADDR15" />
         </register>
         <register caption="Parallel Port Read Address Register" name="PMRADDR" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="RADDR" />
            <bitfield mask="0x00004000" name="RADDR14" />
            <bitfield mask="0x00008000" name="RADDR15" />
         </register>
         <register caption="Parallel Port Read Input Data Register" name="PMRDIN" offset="0x90" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="RDATAIN" />
         </register>
      </register-group>
      <value-group caption="Read Strobe Polarity bit" name="PMCON__RDSP">
         <value caption="(Slave and Master mode 2) Read Strobe active-high / (Master mode 1) Read/write strobe active-high" name="" value="0x1" />
         <value caption="(Slave and Master mode 2) Read Strobe active-low / (Master mode 1) Read/write strobe active-low" name="" value="0x0" />
      </value-group>
