MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX130F128H.atdf
         <register caption="" name="RPD15R" offset="0xfc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPD15R" />
         </register>
         <register caption="" name="RPE0R" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE0R" />
         </register>
         <register caption="" name="RPE1R" offset="0x104" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE1R" />
         </register>
         <register caption="" name="RPE2R" offset="0x108" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE2R" />
         </register>
         <register caption="" name="RPE3R" offset="0x10c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE3R" />
         </register>
         <register caption="" name="RPE4R" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE4R" />
         </register>
         <register caption="" name="RPE5R" offset="0x114" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE5R" />
         </register>
         <register caption="" name="RPE6R" offset="0x118" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE6R" />
         </register>
         <register caption="" name="RPE7R" offset="0x11c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE7R" />
         </register>
         <register caption="" name="RPE8R" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE8R" />
         </register>
         <register caption="" name="RPE9R" offset="0x124" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE9R" />
         </register>
         <register caption="" name="RPE10R" offset="0x128" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE10R" />
         </register>
         <register caption="" name="RPE11R" offset="0x12c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE11R" />
         </register>
         <register caption="" name="RPE12R" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE12R" />
         </register>
         <register caption="" name="RPE13R" offset="0x134" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE13R" />
         </register>
         <register caption="" name="RPE14R" offset="0x138" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE14R" />
         </register>
         <register caption="" name="RPE15R" offset="0x13c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPE15R" />
         </register>
         <register caption="" name="RPF0R" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF0R" />
         </register>
         <register caption="" name="RPF1R" offset="0x144" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF1R" />
         </register>
         <register caption="" name="RPF2R" offset="0x148" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF2R" />
         </register>
         <register caption="" name="RPF3R" offset="0x14c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF3R" />
         </register>
         <register caption="" name="RPF4R" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF4R" />
         </register>
         <register caption="" name="RPF5R" offset="0x154" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF5R" />
         </register>
         <register caption="" name="RPF6R" offset="0x158" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF6R" />
         </register>
         <register caption="" name="RPF7R" offset="0x15c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF7R" />
         </register>
         <register caption="" name="RPF8R" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF8R" />
         </register>
         <register caption="" name="RPF9R" offset="0x164" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF9R" />
         </register>
         <register caption="" name="RPF10R" offset="0x168" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF10R" />
         </register>
         <register caption="" name="RPF11R" offset="0x16c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF11R" />
         </register>
         <register caption="" name="RPF12R" offset="0x170" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF12R" />
         </register>
         <register caption="" name="RPF13R" offset="0x174" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF13R" />
         </register>
         <register caption="" name="RPF14R" offset="0x178" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF14R" />
         </register>
         <register caption="" name="RPF15R" offset="0x17c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF15R" />
         </register>
         <register caption="" name="RPG0R" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG0R" />
         </register>
         <register caption="" name="RPG1R" offset="0x184" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG1R" />
         </register>
         <register caption="" name="RPG2R" offset="0x188" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG2R" />
         </register>
         <register caption="" name="RPG3R" offset="0x18c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG3R" />
         </register>
         <register caption="" name="RPG4R" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG4R" />
         </register>
         <register caption="" name="RPG5R" offset="0x194" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG5R" />
         </register>
         <register caption="" name="RPG6R" offset="0x198" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG6R" />
         </register>
